[{
        "id": "1",
        "title": "Assassin's Creed",
        "year": "2016",
        "rating": "PG-13",
        "genres": ["fantasy", "science fiction"],
        "length": "140",
        "director": "Justin Kurzel",
        "summary": "Cal Lynch travels back in time to 15th-century Spain through a revolutionary technology that unlocks the genetic memories contained in his DNA. There, he lives out the experiences of Aguilar de Nerha, a distant relative who's also a member of the Assassins, a secret society that fights to protect free will from the power-hungry Templar Order. Transformed by the past, Cal begins to gain the knowledge and physical skills necessary to battle the oppressive organization in the present.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1485292905/assassins-creed_lg5l1c.jpg"
    },
    {
        "id": "2",
        "title": "X-Men: First Class",
        "year": "2011",
        "rating": "PG-13",
        "genres": ["fantasy", "thriller"],
        "length": "132",
        "director": "Matthew Vaughn",
        "summary": "In the early 1960s, during the height of the Cold War, a mutant named Charles Xavier (James McAvoy) meets a fellow mutant named Erik Lehnsherr (Michael Fassbender). Despite their vastly different backgrounds -- Charles grew up with a wealthy family, while Erik lost his parents at Auschwitz -- the two become close friends. As the world teeters on the brink of a nuclear war, Charles and Erik with other mutants join forces to save humanity. However, a situation soon tears the friends apart.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1485293753/xmen-first-class_loekpm.jpg"
    },
    {
        "id": "3",
        "title": "X-Men: Apocalypse",
        "year": "2016",
        "rating": "PG-13",
        "genres": ["fantasy", "science fiction"],
        "length": "147",
        "director": "Bryan Singer",
        "summary": "X-Men: Apocalypse is a 2016 American superhero film based on the fictional X-Men characters that appear in Marvel Comics. It is the ninth installment in the X-Men film series and a sequel to X-Men: Days of Future Past.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1485292907/xmen-apocalypse_niqazd.jpg"
    },
    {
        "id": "4",
        "title": "Inception",
        "year": "2010",
        "rating": "PG-13",
        "genres": ["mystery", "science fiction"],
        "length": "148",
        "director": "Christopher Nolan",
        "summary": "Dom Cobb (Leonardo DiCaprio) is a thief with the rare ability to enter people's dreams and steal their secrets from their subconscious. His skill has made him a hot commodity in the world of corporate espionage but has also cost him everything he loves. Cobb gets a chance at redemption when he is offered a seemingly impossible task: Plant an idea in someone's mind. If he succeeds, it will be the perfect crime, but a dangerous enemy anticipates Cobb's every move.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1485292911/inception_booxyv.jpg"
    },
    {
        "id": "5",
        "title": "X-Men: Days of Future Past",
        "year": "2014",
        "rating": "PG-13",
        "genres": ["fantasy", "thriller"],
        "length": "158",
        "director": "Bryan Singer",
        "summary": "Convinced that mutants pose a threat to humanity, Dr. Bolivar Trask (Peter Dinklage) develops the Sentinels, enormous robotic weapons that can detect a mutant gene and zero in on that person. In the 21st century, the Sentinels have evolved into highly efficient killing machines. With mutants now facing extinction, Wolverine (Hugh Jackman) volunteers to go back in time and rally the X-Men of the past to help change a pivotal moment in history and thereby save their future.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1485296007/xmen-days-of-future-past_ikpl6n.jpg"
    },
    {
        "id": "6",
        "title": "X-Men",
        "year": "2000",
        "rating": "PG-13",
        "genres": ["fantasy", "science fiction"],
        "length": "104",
        "director": "Bryan Singer",
        "summary": "X-Men is a 2000 American superhero film based on the Marvel Comics superhero team of the same name, distributed by 20th Century Fox. It is the first installment in the X-Men film series, followed by X2 in 2003 and X-Men: The Last Stand in 2006.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1485297224/x-men_krhikd.jpg"
    },
    {
        "id": "7",
        "title": "The Dark Knight Rises",
        "year": "2012",
        "rating": "PG-13",
        "genres": ["thriller", "action"],
        "length": "165",
        "director": "Christopher Nolan",
        "summary": "It has been eight years since Batman (Christian Bale), in collusion with Commissioner Gordon (Gary Oldman), vanished into the night. Assuming responsibility for the death of Harvey Dent, Batman sacrificed everything for what he and Gordon hoped would be the greater good. However, the arrival of a cunning cat burglar (Anne Hathaway) and a merciless terrorist named Bane (Tom Hardy) force Batman out of exile and into a battle he may not be able to win.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1485292907/dark-knight-rises_slmvc6.jpg"
    },
    {
        "id": "8",
        "title": "The Dark Knight",
        "year": "2008",
        "rating": "PG-13",
        "genres": ["crime", "drama"],
        "length": "152",
        "director": "Christopher Nolan",
        "summary": "With the help of allies Lt. Jim Gordon (Gary Oldman) and DA Harvey Dent (Aaron Eckhart), Batman (Christian Bale) has been able to keep a tight lid on crime in Gotham City. But when a vile young criminal calling himself the Joker (Heath Ledger) suddenly throws the town into chaos, the caped Crusader begins to tread a fine line between heroism and vigilantism.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1485292908/dark-knight_fwoizn.jpg"
    },
    {
        "id": "9",
        "title": "Batman Begins",
        "year": "2005",
        "rating": "PG-13",
        "genres": ["crime", "fantasy"],
        "length": "140",
        "director": "Christopher Nolan",
        "summary": "A young Bruce Wayne (Christian Bale) travels to the Far East, where he's trained in the martial arts by Henri Ducard (Liam Neeson), a member of the mysterious League of Shadows. When Ducard reveals the League's true purpose -- the complete destruction of Gotham City -- Wayne returns to Gotham intent on cleaning up the city without resorting to murder. With the help of Alfred (Michael Caine), his loyal butler, and Lucius Fox (Morgan Freeman), a tech expert at Wayne Enterprises, Batman is born.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1485292906/batman-begins_w0lisw.jpg"
    },
    {
        "id": "10",
        "title": "The Hobbit: The Battle of Five Armies",
        "year": "2014",
        "rating": "PG-13",
        "genres": ["action", "fantasy"],
        "length": "164",
        "director": "Peter Jackson",
        "summary": "This final battle brings to an epic conclusion the adventures of Bilbo Baggins, Thorin Oakenshield, and the Company of Dwarves. Having reclaimed their homeland from the Dragon Smaug, the Company has unwittingly unleashed a deadly force into the world. Enraged, Smaug rains his fiery wrath down upon the defenseless men, women and children of Lake-town. Obsessed above all else with his reclaimed treasure, Thorin sacrifices friendship and honor to hoard it as Bilbo's frantic attempts to make him see reason drive the Hobbit towards a desperate and dangerous choice. But there are even greater dangers ahead. Unseen by any but the Wizard Gandalf, the great enemy Sauron has sent forth legions of Orcs in a stealth attack upon the Lonely Mountain. As darkness converges on their escalating conflict, the races of Dwarves, Elves and Men must decide: unite or be destroyed. Bilbo finds himself fighting for his life and the lives of his friends in the epic Battle of the Five Armies, as the future of Middle-earth hangs in the balance.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1485292910/hobbit_wyvqia.jpg"
    },
    {
        "id": "11",
        "title": "The Lord of the Rings: The Fellowship of the Ring",
        "year": "2001",
        "rating": "PG-13",
        "genres": ["drama", "fantasy"],
        "length": "228",
        "director": "Peter Jackson",
        "summary": "The future of civilization rests in the fate of the One Ring, which has been lost for centuries. Powerful forces are unrelenting in their search for it. But fate has placed it in the hands of a young Hobbit named Frodo Baggins (Elijah Wood), who inherits the Ring and steps into legend.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1485559371/lotr-fellowship_wybasq.jpg"
    },
    {
        "id": "12",
        "title": "The Avengers",
        "year": "2012",
        "rating": "PG-13",
        "genres": ["science fiction", "fantasy"],
        "length": "143",
        "director": "Joss Whedon",
        "summary": "Marvel's The Avengers, or simply The Avengers, is a 2012 American superhero film based on the Marvel Comics superhero team of the same name, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1485292907/avengers_npo9zk.jpg"
    },
    {
        "id": "13",
        "title": "Captain America: Civil War",
        "year": "2016",
        "rating": "PG-13",
        "genres": ["science fiction", "action"],
        "length": "147",
        "director": "Joe Russo",
        "summary": "Political pressure mounts to install a system of accountability when the actions of the Avengers lead to collateral damage. The new status quo deeply divides members of the team. Captain America (Chris Evans) believes superheroes should remain free to defend humanity without government interference. Iron Man (Robert Downey Jr.) sharply disagrees and supports oversight. As the debate escalates into an all-out feud, Black Widow (Scarlett Johansson) and Hawkeye (Jeremy Renner) must pick a side.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487351890/Civil-War_jxr1e1.jpg"
    },
    {
        "id": "14",
        "title": "Les Miserables",
        "year": "2012",
        "rating": "PG-13",
        "genres": ["drama", "romance"],
        "length": "160",
        "director": "Tom Hooper",
        "summary": "Les Misérables is a 2012 British-American musical drama film directed by Tom Hooper and scripted by William Nicholson, Alain Boublil, Claude-Michel Schönberg, and Herbert Kretzmer, based on the musical Les Miserables.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487352282/les-miserables_ekilvx.jpg"
    },
    {
        "id": "15",
        "title": "Interstellar",
        "year": "2014",
        "rating": "PG-13",
        "genres": ["drama", "romance"],
        "length": "160",
        "director": "Christopher Nolan",
        "summary": "Interstellar is a 2014 epic science fiction film co-written, co-produced, and directed by Christopher Nolan. The film stars Matthew McConaughey, Anne Hathaway, Jessica Chastain, Bill Irwin, Ellen Burstyn and Michael Caine.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487352784/interstellar_gyatcd.jpg"
    },
    {
        "id": "16",
        "title": "Miss Congeniality",
        "year": "2000",
        "rating": "PG-13",
        "genres": ["action", "comedy"],
        "length": "110",
        "director": "Donald Petrie",
        "summary": "When a terrorist threatens to bomb the Miss United States pageant, the FBI rushes to find a female agent to go undercover as a contestant. Unfortunately, Gracie is the only female FBI agent who can \"look the part\" despite her complete lack of refinement and femininity. She prides herself in being \"just one of the boys\" and is horrified at the idea of becoming a girly girl.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487353569/miss_congeniality_qvdd1i.jpg"
    },
    {
        "id": "17",
        "title": "Now You See Me",
        "year": "2013",
        "rating": "PG-13",
        "genres": ["crime", "caper"],
        "length": "125",
        "director": "Louis Leterrier",
        "summary": "Charismatic magician Atlas (Jesse Eisenberg) leads a team of talented illusionists called the Four Horsemen. Atlas and his comrades mesmerize audiences with a pair of amazing magic shows that drain the bank accounts of the corrupt and funnel the money to audience members. A federal agent (Mark Ruffalo) and an Interpol detective (Mélanie Laurent) intend to rein in the Horsemen before their next caper, and they turn to Thaddeus (Morgan Freeman), a famous debunker, for help.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487353948/now-you-see-me_lnaywu.jpg"
    },
    {
        "id": "18",
        "title": "Deep Impact",
        "year": "1998",
        "rating": "PG-13",
        "genres": ["disaster", "thriller"],
        "length": "125",
        "director": "Mimi Leder",
        "summary": "Deep Impact is a 1998 American science fiction disaster film directed by Mimi Leder, written by Bruce Joel Rubin and Michael Tolkin, and starring Robert Duvall, Téa Leoni, Elijah Wood, Vanessa Redgrave, Maximilian Schell, and Morgan Freeman.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487354355/deep-impact_p3tdys.jpg"
    },
    {
        "id": "19",
        "title": "The Lego Movie",
        "year": "2014",
        "rating": "PG",
        "genres": ["fantasy", "adventure"],
        "length": "101",
        "director": "Phil Lord",
        "summary": "Emmet (Chris Pratt), an ordinary LEGO figurine who always follows the rules, is mistakenly identified as the Special -- an extraordinary being and the key to saving the world. He finds himself drafted into a fellowship of strangers who are on a mission to stop an evil tyrant's (Will Ferrell) plans to conquer the world. Unfortunately for Emmet, he is hopelessly -- and hilariously -- unprepared for such a task, but he'll give it his all nonetheless.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487354801/lego-movie_nucjjb.jpg"
    },
    {
        "id": "20",
        "title": "March of the Penguins",
        "year": "2005",
        "rating": "G",
        "genres": ["documentary"],
        "length": "86",
        "director": "Luc Jacquet",
        "summary": "At the end of each Antarctic summer, the emperor penguins of the South Pole journey to their traditional breeding grounds in a fascinating mating ritual that is captured in this documentary by intrepid filmmaker Luc Jacquet. The journey across frozen tundra proves to be the simplest part of the ritual, as after the egg is hatched, the female must delicately transfer it to the male and make her way back to the distant sea to nourish herself and bring back food to her newborn chick.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487355163/March_of_the_penguins_poster_ogzqkf.jpg"
    },
    {
        "id": "21",
        "title": "Star Wars: Episode I - The Phantom Menace",
        "year": "1999",
        "rating": "PG",
        "genres": ["fantasy", "science fiction"],
        "length": "136",
        "director": "George Lucas",
        "summary": "Star Wars: Episode I – The Phantom Menace is a 1999 American epic space opera film written and directed by George Lucas, produced by Lucasfilm and distributed by 20th Century Fox.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487355471/Star_Wars_Phantom_Menace_poster_yrchze.jpg"
    },
    {
        "id": "22",
        "title": "Blackhat",
        "year": "2015",
        "rating": "R",
        "genres": ["drama", "thriller"],
        "length": "135",
        "director": "Michael Mann",
        "summary": "After a Hong Kong nuclear plant and the Mercantile Trade Exchange in Chicago are hacked by unknown perpetrators, a federal agent (Viola Davis) proposes that the FBI work with China to find the cyber-criminals. The leader of the Chinese team, Chen Dawai, insists that convicted hacker Nick Hathaway (Chris Hemsworth) be released from prison to help with the investigation. As Nick and his comrades chase their quarry, it becomes evident that the hackers have a sinister motive for their actions.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1485292906/blackhat_h2camb.jpg"
    },
    {
        "id": "23",
        "title": "Captain America: The First Avenger",
        "year": "2011",
        "rating": "PG-13",
        "genres": ["science fiction", "thriller"],
        "length": "124",
        "director": "Joe Johnston",
        "summary": "Captain America: The First Avenger is a 2011 American superhero film based on the Marvel Comics character Captain America, produced by Marvel Studios and distributed by Paramount Pictures. It is the fifth film in the Marvel Cinematic Universe.",
        "image_url": "http://res.cloudinary.com/dyw4edyuf/image/upload/v1487356256/captain-america_xbvksr.jpg"
    },
    {
        "id": "24",
        "title": "Star Trek Into Darkness",
        "year": "2013",
        "rating": "PG-13",
        "genres": ["action", "adventure"],
        "length": "134",
        "director": "J.J. Abrams",
        "summary": "The crew of the Starship Enterprise returns home after an act of terrorism within its own organization destroys most of Starfleet and what it represents, leaving Earth in a state of crisis. With a personal score to settle, Capt. James T. Kirk (Chris Pine) leads his people (Zachary Quinto, Karl Urban, Zoë Saldana) on a mission to capture a one-man weapon of mass destruction, thereby propelling all of them into an epic game of life and death.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487356442/Star_Trek_into_Darkness_hgzzam.jpg"
    },
    {
        "id": "25",
        "title": "Pirates of the Caribbean",
        "year": "2003",
        "rating": "PG-13",
        "genres": ["action", "fantasy"],
        "length": "143",
        "director": "Gore Verbinski",
        "summary": "Pirates of the Caribbean is a series of fantasy swashbuckler films produced by Jerry Bruckheimer and based on Walt Disney's theme park ride of the same name.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487356760/pirates_rtj1zd.jpg"
    },
    {
        "id": "26",
        "title": "Indiana Jones and the Kingdom of the Crystal Skull",
        "year": "2008",
        "rating": "PG-13",
        "genres": ["action", "fantasy"],
        "length": "124",
        "director": "Steven Spielberg",
        "summary": "It's the height of the Cold War, and famous archaeologist Indiana Jones (Harrison Ford), returning from his latest adventure, finds out his job at Marshall College is in jeopardy. He meets Mutt (Shia La Beouf), a young man who wants Indy to help him find the legendary Crystal Skull of Akator, and the pair set out for Peru. However, deadly agent Irina Spalko (Cate Blanchett) is searching for the powerful artifact, too, because the Soviets believe it can help them conquer the world.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487357028/Kingdomofthecrystalskull_g0vam4.jpg"
    },
    {
        "id": "27",
        "title": "Raiders of the Lost Ark",
        "year": "1981",
        "rating": "PG",
        "genres": ["action", "fantasy"],
        "length": "115",
        "director": "Steven Spielberg",
        "summary": "As the Third Reich continues its reign of terror, Adolf Hitler is on a quest for the legendary Ark os the Covenenant- resting place of the Ten Commandments- whose supernatural powers, legend says, can wipe out entire armies. The U.S. Government turns to Dr. Indiana Jones, for the mission. Relentlessly pursued by Hitler's henchmen, Indy infiltrartes their massive digging operation in a race against time to discover the Well od the Souls, where the Ark has lain undisturbed for centuries.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487357370/Raiders_of_the_Lost_Ark_vegqpb.jpg"
    },
    {
        "id": "28",
        "title": "Ponyo",
        "year": "2009",
        "rating": "G",
        "genres": ["drama", "fantasy"],
        "length": "103",
        "director": "Hiyao Miyazaki",
        "summary": "\"Ponyo\" is a story inspired by Hans Christian Andersen's fairy tale \"The Little Mermaid\" in which a young and overeager goldfish named Ponyo seeks to become human.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487357611/ponyo_jvkgmf.jpg"
    },
    {
        "id": "29",
        "title": "Charlie and the Chocolate Factory",
        "year": "2005",
        "rating": "PG",
        "genres": ["adventure", "fantasy"],
        "length": "115",
        "director": "Tim Burton",
        "summary": "Based on the beloved Roald Dahl tale, this comedic and fantastical film follows young Charlie Bucket (Freddie Highmore) and his Grandpa Joe (David Kelly) as they join a small group of contest winners who get to tour the magical and mysterious factory of eccentric candy maker Willy Wonka (Johnny Depp). Aided by his diminutive Oompa Loompa workers (Deep Roy), Wonka has a hidden motivation for the tour, one that he will reveal only after the children in the group show their true colors.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487357897/charlie-and-the-chocolate_sgnna5.jpg"
    },
    {
        "id": "30",
        "title": "Star Wars: Episode III - Revenge of the Sith",
        "year": "2005",
        "rating": "PG",
        "genres": ["science fiction", "fantasy"],
        "length": "140",
        "director": "George Lucas",
        "summary": "Star Wars: Episode III – Revenge of the Sith is a 2005 American epic space opera film written and directed by George Lucas. It is the third installment of the Star Wars prequel trilogy.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487358116/star-wars-revenge-of-sith_uhiyjf.jpg"
    },
    {
        "id": "31",
        "title": "Alice in Wonderland",
        "year": "2010",
        "rating": "PG",
        "genres": ["fantasy"],
        "length": "109",
        "director": "Tim Burton",
        "summary": "A young girl when she first visited magical Underland, Alice Kingsleigh (Mia Wasikowska) is now a teenager with no memory of the place -- except in her dreams. Her life takes a turn for the unexpected when, at a garden party for her fiance and herself, she spots a certain white rabbit and tumbles down a hole after him. Reunited with her friends the Mad Hatter (Johnny Depp), the Cheshire Cat and others, Alice learns it is her destiny to end the Red Queen's (Helena Bonham Carter) reign of terror.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487358402/Alice_In_Wonderland_evhfh6.jpg"
    },
    {
        "id": "32",
        "title": "Sherlock Holmes: A Game of Shadows",
        "year": "2011",
        "rating": "PG-13",
        "genres": ["thriller", "drama"],
        "length": "129",
        "director": "Guy Ritchie",
        "summary": "When Austria's crown prince is found dead, evidence seems to point to suicide. However, detective Sherlock Holmes (Robert Downey Jr.) deduces that the prince was murdered and that the crime is but a piece of a puzzle designed by an evil genius named Moriarty (Jared Harris). Holmes and his friend Dr. Watson (Jude Law), who are accompanied by a Gypsy (Noomi Rapace) whose life Holmes saved, chase Moriarty across Europe in the hope that they can thwart his plot before it can come to fruition.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487358924/sherlock_holmes_a_game_of_shadows_phci28.jpg"
    },
    {
        "id": "33",
        "title": "Hitchhiker's Guide to the Galaxy",
        "year": "2005",
        "rating": "PG",
        "genres": ["adventure", "comedy"],
        "length": "110",
        "director": "Garth Jennings",
        "summary": "When Austria's crown prince is found dead, evidence seems to point to suicide. However, detective Sherlock Holmes (Robert Downey Jr.) deduces that the prince was murdered and that the crime is but a piece of a puzzle designed by an evil genius named Moriarty (Jared Harris). Holmes and his friend Dr. Watson (Jude Law), who are accompanied by a Gypsy (Noomi Rapace) whose life Holmes saved, chase Moriarty across Europe in the hope that they can thwart his plot before it can come to fruition.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487359083/Hitchhikers_guide_to_the_galaxy_siggse.jpg"
    },
    {
        "id": "34",
        "title": "Ant-Man",
        "year": "2015",
        "rating": "PG",
        "genres": ["science fiction", "thriller"],
        "length": "118",
        "director": "Peyton Reed",
        "summary": "Forced out of his own company by former protégé Darren Cross, Dr. Hank Pym (Michael Douglas) recruits the talents of Scott Lang (Paul Rudd), a master thief just released from prison. Lang becomes Ant-Man, trained by Pym and armed with a suit that allows him to shrink in size, possess superhuman strength and control an army of ants. The miniature hero must use his new skills to prevent Cross, also known as Yellowjacket, from perfecting the same technology and using it as a weapon for evil.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487359480/antman_q9u1nx.jpg"
    },
    {
        "id": "35",
        "title": "Witness",
        "year": "1985",
        "rating": "R",
        "genres": ["drama", "thriller"],
        "length": "112",
        "director": "Peter Weir",
        "summary": "Witness is a 1985 American crime thriller film directed by Peter Weir and starring Harrison Ford and Kelly McGillis.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487359661/witness_dtoxka.jpg"
    },
    {
        "id": "36",
        "title": "28 Days",
        "year": "2000",
        "rating": "PG-13",
        "genres": ["drama", "comedy"],
        "length": "104",
        "director": "Betty Thomas",
        "summary": "28 Days is a 2000 American comedy-drama film directed by Betty Thomas. Sandra Bullock plays Gwen Cummings, a newspaper columnist obliged to enter rehabilitation for alcoholism.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487359996/28-days_nlzzzu.jpg"
    },
    {
        "id": "37",
        "title": "Patriot Games",
        "year": "1992",
        "rating": "R",
        "genres": ["drama", "thriller"],
        "length": "117",
        "director": "Phillip Noyce",
        "summary": "Patriot Games is a 1992 American spy thriller film directed by Phillip Noyce and based on Tom Clancy's novel of the same name.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487360180/patriot-games_zfwbw6.jpg"
    },
    {
        "id": "38",
        "title": "The Martian",
        "year": "2015",
        "rating": "PG-13",
        "genres": ["drama", "science fiction"],
        "length": "151",
        "director": "Ridley Scott",
        "summary": "When astronauts blast off from the planet Mars, they leave behind Mark Watney (Matt Damon), presumed dead after a fierce storm. With only a meager amount of supplies, the stranded visitor must utilize his wits and spirit to find a way to survive on the hostile planet. Meanwhile, back on Earth, members of NASA and a team of international scientists work tirelessly to bring him home, while his crew mates hatch their own plan for a daring rescue mission.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1485292911/martian_gputrg.jpg"
    },
    {
        "id": "39",
        "title": "The Incredible Hulk",
        "year": "2008",
        "rating": "PG-13",
        "genres": ["thriller", "action"],
        "length": "114",
        "director": "Louis Leterrier",
        "summary": "The Incredible Hulk is a 2008 American superhero film based on the Marvel Comics character the Hulk, produced by Marvel Studios and distributed by Universal Pictures. It is the second film in the Marvel Cinematic Universe.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487360632/hulk_j7ebky.jpg"
    },
    {
        "id": "40",
        "title": "Star Trek",
        "year": "2009",
        "rating": "PG-13",
        "genres": ["fantasy", "drama"],
        "length": "128",
        "director": "J.J. Abrams",
        "summary": "Aboard the USS Enterprise, the most-sophisticated starship ever built, a novice crew embarks on its maiden voyage. Their path takes them on a collision course with Nero (Eric Bana), a Romulan commander whose mission of vengeance threatens all mankind. If humanity would survive, a rebellious young officer named James T. Kirk (Chris Pine) and a coolly logical Vulcan named Spock (Zachary Quinto) must move beyond their rivalry and find a way to defeat Nero before it is too late.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1485292904/star-trek_jkkuku.jpg"
    },
    {
        "id": "41",
        "title": "The Bourne Legacy",
        "year": "2012",
        "rating": "PG-13",
        "genres": ["thriller", "action"],
        "length": "135",
        "director": "Tony Gilroy",
        "summary": "The Bourne Legacy is a 2012 American action film directed by Tony Gilroy, and is the fourth installment in the series of films adapted from the Jason Bourne novels originated by Robert Ludlum.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1485292906/bourne-legacy_oajenj.jpg"
    },
    {
        "id": "42",
        "title": "Harry Potter and the Sorceror's Stone",
        "year": "2001",
        "rating": "PG",
        "genres": ["fantasy", "action"],
        "length": "159",
        "director": "Chris Columbus",
        "summary": "Adaptation of the first of J.K. Rowling's popular children's novels about Harry Potter, a boy who learns on his eleventh birthday that he is the orphaned son of two powerful wizards and possesses unique magical powers of his own. He is summoned from his life as an unwanted child to become a student at Hogwarts, an English boarding school for wizards. There, he meets several friends who become his closest allies and help him discover the truth about his parents' mysterious deaths.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487361719/harry-potter-1_azg07u.jpg"
    },
    {
        "id": "43",
        "title": "Harry Potter and the Chamber of Secrets",
        "year": "2002",
        "rating": "PG",
        "genres": ["fantasy", "mystery"],
        "length": "135",
        "director": "Chris Columbus",
        "summary": "The follow-up to \"Harry Potter and the Sorcerer's Stone\" finds young wizard Harry Potter (Daniel Radcliffe) and his friends, Ron (Rupert Grint) and Hermione (Emma Watson), facing new challenges during their second year at Hogwarts School of Witchcraft and Wizardry as they try to discover a dark force that is terrorizing the school.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487361723/harry-potter-2_tmhti9.jpg"
    },
    {
        "id": "44",
        "title": "Harry Potter and the Prisoner of Azkaban",
        "year": "2004",
        "rating": "PG",
        "genres": ["fantasy", "mystery"],
        "length": "142",
        "director": "Alfonso Cuaron",
        "summary": "Thirteen year-old Harry Potter has reluctantly spent yet another summer with the Dursleys, his dismal relatives, \"behaving himself\" and not practicing any magic. That is, until Uncle Vernon's bullying sister, Aunt Marge, comes to visit. Aunt Marge has always been particularly horrible to Harry and this time pushes him so far that he \"accidentally\" causes her to inflate like a monstrous balloon and drift away! Fearing punishment from his Aunt and Uncle--and repercussions from Hogwarts and the Ministry of Magic, which strictly forbids students from using magic in the non-magic world--Harry escapes into the night. Along the way, Harry will try to make sense of Hermione's puzzling appearances and disappearances, with the help of Ron and the giant Hagrid, who has taken on a new position at Hogwarts as the Care of Magical Creatures teacher. A confrontation between Harry and the menacing Sirius Black seems inevitable, but what exactly is Professor Lupin's relationship with Black? What is the dark secret that Professor Snape is so eager to reveal? And just why is Ron's pet rat Scabbers so frantic to escape his grasp? Harry will need all of the courage, magic and support he can muster to answer these questions and uncover the truth behind Sirius Black and his ties to the gifted young wizard's mysterious past.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487361714/harry-potter-3_rxzkyr.jpg"
    },
    {
        "id": "45",
        "title": "Harry Potter and the Goblet of Fire",
        "year": "2005",
        "rating": "PG-13",
        "genres": ["fantasy", "mystery"],
        "length": "157",
        "director": "Mike Newell",
        "summary": "In \"Harry Potter and the Goblet of Fire,\" Harry must contend with being mysteriously selected to compete in the prestigious Triwizard Tournament, a thrilling international competition that pits him against older and more experienced students from Hogwarts and two rival European wizarding schools. Meanwhile, supporters of Harry's nemesis, the evil Lord Voldemort send a shockwave of fear throughout the wizard community when their Dark Mark scorches the sky at the Quidditch World Cup, signaling Voldemort's return to power. But for Harry, this is not the only harrowing news causing him anxiety...he still has yet to find a date for Hogwarts' Yule Ball dance.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487361682/harry-potter-4_vlzpls.jpg"
    },
    {
        "id": "46",
        "title": "Harry Potter and the Order of the Phoenix",
        "year": "2007",
        "rating": "PG-13",
        "genres": ["fantasy", "mystery"],
        "length": "142",
        "director": "David Yates",
        "summary": "Now in his fifth year at Hogwarts, Harry (Daniel Radcliffe) learns that many in the wizarding community do not know the truth of his encounter with Lord Voldemort. Cornelius Fudge, minister of Magic, appoints his toady, Dolores Umbridge, as Defense Against the Dark Arts teacher, for he fears that professor Dumbledore will take his job. But her teaching is deficient and her methods, cruel, so Harry prepares a group of students to defend the school against a rising tide of evil.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487361680/harry-potter-5_kedutd.jpg"
    },
    {
        "id": "47",
        "title": "Harry Potter and the Half-Blood Prince",
        "year": "2009",
        "rating": "PG",
        "genres": ["fantasy"],
        "length": "153",
        "director": "David Yates",
        "summary": "As Death Eaters wreak havoc in both Muggle and Wizard worlds, Hogwarts is no longer a safe haven for students. Though Harry (Daniel Radcliffe) suspects there are new dangers lurking within the castle walls, Dumbledore is more intent than ever on preparing the young wizard for the final battle with Voldemort. Meanwhile, teenage hormones run rampant through Hogwarts, presenting a different sort of danger. Love may be in the air, but tragedy looms, and Hogwarts may never be the same again.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487361676/harry-potter-6_d8wmfi.jpg"
    },
    {
        "id": "48",
        "title": "Harry Potter and the Deathly Hallows, Pt. 1",
        "year": "2010",
        "rating": "PG-13",
        "genres": ["fantasy", "drama"],
        "length": "146",
        "director": "David Yates",
        "summary": "\"Harry Potter and the Deathly Hallows\" is a much-anticipated motion picture event to be told in two full-length parts. The long-feared war has begun and Voldemort's Death Eaters seize control of the Ministry of Magic and even Hogwarts, terrorizing and arresting anyone who might oppose them. But the one prize they still seek is the one most valuable to Voldemort: Harry Potter. Harry's only hope is to find the Horcruxes before Voldemort finds him. As he searches for clues, he uncovers the legend of the Deathly Hallows. And if the legend turns out to be true, it could give Voldemort the ultimate power he seeks. No longer just a boy, Harry Potter is drawing ever closer to the ultimate battle with Voldemort.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487361672/harry-potter-7-1_nngjzh.jpg"
    },
    {
        "id": "49",
        "title": "Harry Potter and the Deathly Hallows, Pt. 2",
        "year": "2011",
        "rating": "PG-13",
        "genres": ["fantasy"],
        "length": "131",
        "director": "David Yates",
        "summary": "In the epic finale, the battle between the good and evil forces of the wizarding world escalates into an all-out war. The stakes have never been higher and no one is safe. But it is Harry Potter who may be called upon to make the ultimate sacrifice as he draws closer to the climactic showdown with Lord Voldemort.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487361674/harry-potter-7-2_lw9p8z.jpg"
    },
    {
        "id": "50",
        "title": "Sweeney Todd: The Demon Barber of Fleet Street",
        "year": "2007",
        "rating": "R",
        "genres": ["thriller", "drama"],
        "length": "117",
        "director": "Tim Burton",
        "summary": "Evil Judge Turpin (Alan Rickman) lusts for the beautiful wife of a London barber (Johnny Depp) and transports him to Australia for a crime he did not commit. Returning after 15 years and calling himself Sweeney Todd, the now-mad man vows revenge, applying his razor to unlucky customers and shuttling the bodies down to Mrs. Lovett (Helena Bonham Carter), who uses them in her meat-pie shop. Though many fall to his blade, he will not be satisfied until he slits Turpin's throat.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1485292906/bourne-legacy_oajenj.jpg"
    },
    {
        "id": "51",
        "title": "Now You See Me 2",
        "year": "2016",
        "rating": "PG-13",
        "genres": ["mystery", "crime"],
        "length": "129",
        "director": "Jon M. Chu",
        "summary": "Now You See Me 2 is a 2016 American heist thriller film directed by Jon M. Chu and written by Ed Solomon.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487363961/now-you-see-me-2_clnua0.jpg"
    },
    {
        "id": "52",
        "title": "Elf",
        "year": "2003",
        "rating": "PG",
        "genres": ["fantasy", "romance"],
        "length": "97",
        "director": "Jon Favreau",
        "summary": "Buddy (Will Ferrell) was accidentally transported to the North Pole as a toddler and raised to adulthood among Santa's elves. Unable to shake the feeling that he doesn't fit in, the adult Buddy travels to New York, in full elf uniform, in search of his real father. As it happens, this is Walter Hobbs (James Caan), a cynical businessman. After a DNA test proves this, Walter reluctantly attempts to start a relationship with the childlike Buddy with increasingly chaotic results.",
        "image_url": "https://res.cloudinary.com/dyw4edyuf/image/upload/v1487450002/elf_py59x6.jpg"
    }


]
